Revit 2024 API
Space.UpperLimit Property
Get or set the Upper Limit of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Level UpperLimit { get; set; }
Visual Basic
Public Property UpperLimit As Level
	Get
	Set
Visual C++
public:
property Level^ UpperLimit {
	Level^ get ();
	void set (Level^ value);
}
Remarks
This property is used to get or set the Upper Limit of the Space.
See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace